; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	infrared3 - mode
	spectrograph1 - mode
	spectrograph2 - mode
	spectrograph0 - mode
	GroundStation3 - direction
	Star5 - direction
	GroundStation6 - direction
	Star8 - direction
	Star11 - direction
	Star12 - direction
	GroundStation14 - direction
	GroundStation17 - direction
	Star19 - direction
	GroundStation15 - direction
	GroundStation16 - direction
	GroundStation7 - direction
	GroundStation13 - direction
	Star10 - direction
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star9 - direction
	Star4 - direction
	GroundStation18 - direction
	Phenomenon20 - direction
	Planet21 - direction
	Phenomenon22 - direction
	Phenomenon23 - direction
	Phenomenon24 - direction
	Planet25 - direction
	Star26 - direction
	Phenomenon27 - direction
	Star28 - direction
	Phenomenon29 - direction
	Star30 - direction
	Star31 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 GroundStation15)
	(calibration_target instrument0 Star4)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared3)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star10)
	(calibration_target instrument1 GroundStation13)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 GroundStation16)
	(calibration_target instrument1 Star9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation17)
	(supports instrument2 spectrograph2)
	(supports instrument2 spectrograph1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation18)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(pointing satellite1 GroundStation6)
	(have_image Phenomenon20 spectrograph1)
	(have_image Planet21 spectrograph0)
	(have_image Phenomenon22 spectrograph0)
	(have_image Phenomenon23 spectrograph0)
	(have_image Phenomenon24 infrared3)
	(have_image Planet25 spectrograph2)
	(have_image Star26 spectrograph0)
	(have_image Phenomenon27 spectrograph1)
	(have_image Star28 spectrograph0)
	(have_image Phenomenon29 spectrograph1)
	(have_image Star30 infrared3)
	(have_image Star31 infrared3)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 14
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 14
3. (turn_to satellite1 groundstation6 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 groundstation6)
   goals met: 1 of 14
4. (turn_to satellite0 groundstation0 groundstation17)
   deleted: (pointing satellite0 groundstation17)
   added: (pointing satellite0 groundstation0)
   goals met: 2 of 14
5. (turn_to satellite1 star9 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 star9)
   goals met: 1 of 14
6. (calibrate satellite1 instrument2 star9)
   added: (calibrated instrument2)
   goals met: 1 of 14
7. (turn_to satellite1 groundstation6 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation6)
   goals met: 2 of 14
8. (turn_to satellite1 phenomenon20 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 phenomenon20)
   goals met: 1 of 14
9. (take_image satellite1 phenomenon20 instrument2 spectrograph1)
   added: (have_image phenomenon20 spectrograph1)
   goals met: 2 of 14
10. (turn_to satellite1 groundstation6 phenomenon20)
   deleted: (pointing satellite1 phenomenon20)
   added: (pointing satellite1 groundstation6)
   goals met: 3 of 14
11. (turn_to satellite1 phenomenon22 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 phenomenon22)
   goals met: 2 of 14
12. (take_image satellite1 phenomenon22 instrument2 spectrograph0)
   added: (have_image phenomenon22 spectrograph0)
   goals met: 3 of 14
13. (turn_to satellite1 groundstation6 phenomenon22)
   deleted: (pointing satellite1 phenomenon22)
   added: (pointing satellite1 groundstation6)
   goals met: 4 of 14
14. (turn_to satellite1 phenomenon23 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 phenomenon23)
   goals met: 3 of 14
15. (take_image satellite1 phenomenon23 instrument2 spectrograph0)
   added: (have_image phenomenon23 spectrograph0)
   goals met: 4 of 14
16. (turn_to satellite1 groundstation6 phenomenon23)
   deleted: (pointing satellite1 phenomenon23)
   added: (pointing satellite1 groundstation6)
   goals met: 5 of 14
17. (turn_to satellite1 phenomenon27 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 phenomenon27)
   goals met: 4 of 14
18. (take_image satellite1 phenomenon27 instrument2 spectrograph1)
   added: (have_image phenomenon27 spectrograph1)
   goals met: 5 of 14
19. (turn_to satellite1 groundstation6 phenomenon27)
   deleted: (pointing satellite1 phenomenon27)
   added: (pointing satellite1 groundstation6)
   goals met: 6 of 14
20. (turn_to satellite1 phenomenon29 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 phenomenon29)
   goals met: 5 of 14
21. (take_image satellite1 phenomenon29 instrument2 spectrograph1)
   added: (have_image phenomenon29 spectrograph1)
   goals met: 6 of 14
22. (turn_to satellite1 groundstation6 phenomenon29)
   deleted: (pointing satellite1 phenomenon29)
   added: (pointing satellite1 groundstation6)
   goals met: 7 of 14
23. (turn_to satellite1 planet21 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 planet21)
   goals met: 6 of 14
24. (take_image satellite1 planet21 instrument2 spectrograph0)
   added: (have_image planet21 spectrograph0)
   goals met: 7 of 14
25. (turn_to satellite1 groundstation6 planet21)
   deleted: (pointing satellite1 planet21)
   added: (pointing satellite1 groundstation6)
   goals met: 8 of 14
26. (turn_to satellite1 planet25 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 planet25)
   goals met: 7 of 14
27. (take_image satellite1 planet25 instrument2 spectrograph2)
   added: (have_image planet25 spectrograph2)
   goals met: 8 of 14
28. (turn_to satellite1 groundstation6 planet25)
   deleted: (pointing satellite1 planet25)
   added: (pointing satellite1 groundstation6)
   goals met: 9 of 14
29. (turn_to satellite1 star26 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 star26)
   goals met: 8 of 14
30. (take_image satellite1 star26 instrument2 spectrograph0)
   added: (have_image star26 spectrograph0)
   goals met: 9 of 14
31. (turn_to satellite1 groundstation6 star26)
   deleted: (pointing satellite1 star26)
   added: (pointing satellite1 groundstation6)
   goals met: 10 of 14
32. (turn_to satellite1 star28 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 star28)
   goals met: 9 of 14
33. (take_image satellite1 star28 instrument2 spectrograph0)
   added: (have_image star28 spectrograph0)
   goals met: 10 of 14
34. (turn_to satellite1 groundstation6 star28)
   deleted: (pointing satellite1 star28)
   added: (pointing satellite1 groundstation6)
   goals met: 11 of 14
35. (turn_to satellite0 star9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star9)
   goals met: 10 of 14
36. (calibrate satellite0 instrument1 star9)
   added: (calibrated instrument1)
   goals met: 10 of 14
37. (turn_to satellite0 groundstation0 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation0)
   goals met: 11 of 14
38. (turn_to satellite0 phenomenon24 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon24)
   goals met: 10 of 14
39. (take_image satellite0 phenomenon24 instrument1 infrared3)
   added: (have_image phenomenon24 infrared3)
   goals met: 11 of 14
40. (turn_to satellite0 groundstation0 phenomenon24)
   deleted: (pointing satellite0 phenomenon24)
   added: (pointing satellite0 groundstation0)
   goals met: 12 of 14
41. (turn_to satellite0 star30 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star30)
   goals met: 11 of 14
42. (take_image satellite0 star30 instrument1 infrared3)
   added: (have_image star30 infrared3)
   goals met: 12 of 14
43. (turn_to satellite0 groundstation0 star30)
   deleted: (pointing satellite0 star30)
   added: (pointing satellite0 groundstation0)
   goals met: 13 of 14
44. (turn_to satellite0 star31 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star31)
   goals met: 12 of 14
45. (take_image satellite0 star31 instrument1 infrared3)
   added: (have_image star31 infrared3)
   goals met: 13 of 14
46. (turn_to satellite0 groundstation0 star31)
   deleted: (pointing satellite0 star31)
   added: (pointing satellite0 groundstation0)
   goals met: 14 of 14
